import 'dart:io';

import 'package:flutter/material.dart';
import 'package:homecare/widgets/header_widget.dart';

class PrivacyPolicyScreen extends StatelessWidget {
  const PrivacyPolicyScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Padding(
        padding: EdgeInsets.only(top: Platform.isIOS ? 50.0 : 0.0, bottom: 10.0),
        child: Stack(
          children: [
            Center(
              child: Image.asset('assets/images/ALB.png', color: Colors.grey.withValues(alpha: 0.2)),
            ),
            HeaderWidget(context, title: 'سياسة الخصوصية والاستخدام'),
            Directionality(
              textDirection: TextDirection.rtl,
              child: Padding(
                padding: const EdgeInsets.only(left: 10.0, right: 10.0, top: 50.0),
                child: SingleChildScrollView(
                  physics: const BouncingScrollPhysics(),
                  child: Center(
                    child: Column(
                      spacing: 25.0,
                      children: [
                        Text('سياسة الخصوصية لتطبيق ALB', style: TextStyle(fontSize: 20.0, fontWeight: FontWeight.bold)),
                        Text('نحن في ALB نولي أهمية كبيرة لحماية بيانات مستخدمينا وخصوصيتهم، ونلتزم بجمع بياناتهم ومعالجتها وفقاً لأفضل الممارسات القانونية والتقنية.\nمن خلال استخدام التطبيق، فإنك توافق على سياسة الخصوصية هذه وطريقة تعاملنا مع بياناتك الشخصية'
                            '\n\nطبيعة العمل: '
                            '\nALB هو تطبيق تقني يهدف إلى تسهيل التواصل بين الكادر الطبي (الممرضين) والمرضى لتقديم خدمات الزيارات الطبية المنزلية. يعمل التطبيق كوسيط آمن لتنسيق المواعيد، ومشاركة المعلومات الضرورية، وضمان جودة الخدمات المقدمة، دون أن يكون طرفًا مباشرًا في تقديم الرعاية الطبية نفسها.'
                            '\n\nالجهة المسؤولة عن التطبيق:'
                            '\n\nالجهة المالكة والمشغلة:'
                            '\nتطبيق ALB مملوك وتشغله الجهة المسجل في السجل التجاري رقم 0310103175 مدينة ريف دمشق وهي الجهة المسؤولة عن:  '
                            '\n- إدارة البنية التقنية للتطبيق.'
                            '\n- ضمان الامتثال للسياسات والقوانين ذات الصلة.'
                            '\n- توفير الدعم الفني للمستخدمين.'
                            '\n\nعلاقة الجهة بالمستخدمين:'
                            '\nالشركة تعمل كمشغل للتطبيق فقط، ولا تتدخل في التفاصيل المهنية أو الطبية بين الممرضين والمرضى.'
                            '\n\n. الفئات المستهدفة:'
                            '\n•	المرضى: '
                            '\n-	أشخاص فوق سن 18 عامًا يحتاجون إلى رعاية طبية منزلية. '
                            '\n-	يُمنع تسجيل المرضى القاصرين (تحت 18 عامًا) بشكل مباشر ، ولكن يمكن إضافتهم عبر حساب ممرض أو مستخدم مسجَّل كمريض على أن يكون التسجيل تحت إشراف ذوي المريض'
                            '\n•	الممرضون: '
                            '\nكوادر طبية مرخصة وحاصلة على تصاريح مزاولة المهنة.'
                            '\n•	الداعمون: '
                            '\nأفراد أو جهات تدعم التطبيق عن طريق ترشيح مرضى محتملين.'
                            '\n\nالمصادر التي يستخدمها التطبيق في جهاز المستخدم:'
                            '\n\nيطلب التطبيق الوصول إلى الموارد التالية في جهاز المستخدم لأداء وظائفه الأساسية:'
                            '\n•	الكاميرا: لالتقاط صور الأوراق الرسمية (للممرضين) أو توثيق الحالات الطبية (بموافقة المريض).'
                            '\n•	تحديد الموقع (GPS): لتحديد عنوان الزيارة المنزلية بدقة.'
                            '\n•	الذاكرة التخزينية: لرفع الصور والمستندات وتخزين البيانات الضرورية.'
                            '\nملاحظة: يُمكن للمستخدم إدارة صلاحيات الوصول عبر إعدادات جهازه في أي وقت. '
                            '\n\n. سياسة الاستخدام للقاصرين: '
                            '\n. حظر التسجيل المباشر:'
                            '\n•	يُمنع تسجيل المرضى تحت سن 18 عامًا بشكل مستقل.  '
                            '\n•	إضافة القاصرين:'
                            '\n•	يُسمح فقط للممرضين أو المستخدمين المسجلين كـ "مريض" بإضافة بيانات القاصرين، '
                            '\n•	موافقة خطية أو إلكترونية (كود تحقق يُرسل إلى ذوي المريض).'
                            '\n•	حماية البيانات:  '
                            '\n•	تُحفظ بيانات القاصرين بنفس معايير الخصوصية والأمان. '
                            '\n\n1. البيانات التي نقوم بجمعها: عند استخدام التطبيق، نقوم بجمع البيانات التالية :'
                            '\n\n- المرضى\nالاسم الأول والثاني، رقم الهاتف ورقم الهاتف البديل ، العنوان، الجنس وتاريخ الميلاد، معلومات الزيارة الطبية'
                            '\n\n-الممرضون :\nالاسم الأول والثاني، رقم الهاتف ورقم الهاتف البديل، العنوان، الجنس وتاريخ الميلاد، صور الأوراق الرسمية التي تخوله لمزاولة المهنة'
                            '\n\n- الداعمون:\nالاسم الأول والثاني، رقم الهاتف، العنوان، نوع العمل، تاريخ الميلاد'
                            '\n\n- البيانات التقنية: \nسجل النشاط داخل التطبيق، مثل الأوقات والتواريخ'
                            '\n\n\n2. كيفية استخدام البيانات :\nنستخدم البيانات التي يتم جمعها للأغراض التالية :'
                            '\n\n- تقديم خدمات التطبيق وربط المرضى بالممرضين'
                            '\n- تحسين جودة الخدمات المقدمة'
                            '\n- التحقق من هوية المستخدمين وضمان أمان المعاملات داخل التطبيق'
                            '\n- مشاركة بعض البيانات مع الممرضين عند قبول الطلبات، بحيث يمكنهم الاطلاع فقط على معلومات آخر زيارة للمريض لضمان تقديم رعاية مناسبة'
                            '\n- قد نشارك بعض البيانات مع شركات التأمين لتحسين جودة الخدمات، مع ضمان حماية خصوصية المستخدمين'
                            '\n\n\n3. مشاركة البيانات : قد نشارك بياناتك في الحالات التالية :'
                            '\n\n- مع الممرضين: عند قبول الطلب ، يسمح لهم فقط بمشاهدة معلومات آخر زيارة طبية للمريض'
                            '\n- مع شركات التأمين : قد نشارك بعض البيانات بالحد الأدنى اللازم لتحسين جودة الخدمات، مع الامتثال للقوانين المحلية'
                            '\n- عدم مشاركة بيانات الداعمين: بيانات الداعمين محفوظة بشكل كامل ولاتتم مشاركتها مع أي جهة'
                            '\n\n\n4. حقوق المستخدمين :\nيحق للمستخدمين :'
                            '\n\n- الوصول إلى بياناتهم الشخصية وتحديثها أو تصحيحها في أي وقت'
                            '\n- يحق للمستخدم طلب حذف بياناته الشخصية عبر قنوات الدعم الرئيسية، بشرط إثبات ملكيته للحساب بشكل مطلق. تحتفظ إدارة التطبيق بحق قبول أو رفض الطلب وفقاً لمتطلبات التحقق، والالتزامات القانونية، أو أي أسباب تشغيلية تراها الإدارة ضرورية ، مع إشعار المستخدم بقرارها خلال مدة زمنية معقولة.'
                            '\n\n\n5. التزامات المستخدمين : \nيتعين على المستخدمين الالتزام بالآتي :'
                            '\n\n- تقديم بيانات دقيقة ومحدثة لضمان تقديم الخدمات بشكل صحيح'
                            '\n- عدم استخدام التطبيق لأغراض غير مشروعة أو مصرّح بها'
                            '\n- عدم مشاركة بيانات تسجيل الدخول مع أي أطراف أخرى لحماية الحسابات من أي استخدام غير مصرح به'
                            '\n- يتحمل المستخدم المسؤولية الكاملة عن أي استخدام غير مصرح به لحسابه'
                            '\n- التزام الممرض بتقديم خدمات الرعاية الصحية بشكل مستقل وبما يتوافق مع القوانين المحلية.'
                            '\n\n\n6. أمان البيانات:'
                            '\n- نحن نستخدم أحدث تقنيات الحماية لضمان أمان بيانات المستخدمين'
                            '\n- تخزين البيانات علي خوادم آمنة مع نسخ احتياطي دوري'
                            '\nورغم ذلك، لا يمكننا ضمان الحماية المطلقة من أي اختراق أمني أو فقدان للبيانات، ولا نتحمل أي مسؤولية عن أي ضرر ناتج عن ذلك، والمستخدم يقر بأنه يفهم المخاطر التكنولوجية المحتملة ولا نضمن استمرارية الخدمة أو خلوها من الأخطاء بنسبة مئة بالمئة'
                            '\n\n\n7. إخلاء المسؤولية القانونية :'
                            '\n- يعمل التطبيق كوسيط تقني فقط ولا يتحمل أي مسؤولية قانونية عن جودة الخدمات المقدمة من قبل الممرضين ولا يقدم خدمات طبية بشكل مباشر'
                            '\n- الممرضون مستقلون تماماً عن التطبيق ولا يتعبروا موظفين تابعين للتطبيق'
                            '\n- لا يتحمل التطبيق أي مسؤولية قانونية أو مالية تجاه المستخدمين أو الممرضين أو الداعمين بأي حال من الأحوال مسؤولية مباشرة أو غير مباشرة قانونية أو مالية عن أي خسارة أو ضرر ينشأ نتيجة استخدام الأنظمة الرقمية بما في ذلك على سبيل المثال لا الحصر: فقدان البيانات , تعطل الخدمة , هجمات الكترونية , تسريبات من طرف ثالث  و عن أي أضرار ناتجة عن إدخال بيانات غير صحيحة أو إساءة استخدامها من قبل المستخدمين أو الممرضين أو الداعمين على سبيل المثال لا الحصر: إهمال , تأخير أو سوء استخدام أو إخلال بشروط سياسة استخدام التطبيق'
                            '\n- المستخدمون يقرّون باستخدامهم التطبيق بأنهم يعفون إدارة التطبيق من أي مطالبات مالية أو قانونية.'
                            '\n- يعفى التطبيق من أي التزام أو مسؤولية في حال حدوث ظروف خارجة عن إرادته مثل: الكوارث الطبيعية انقطاع انترنت عام , القرصنة العالمية أو الحروب'
                            '\n\n\n8. الموافقات الالكترونية :'
                            '\n- يمكن للمريض الموافقة على إدارة حسابه من قبل ممرض أو مريض آخر، مع إمكانية سحب الموافقة في أي وقت عبر التواصل مع الدعم الفني ، بشرط إثبات ملكية الحساب'
                            '\n- تتم الموافقة الالكترونية عبر إدخال كود تحقق يُرسل إلى المريض المُضاف بعد اطلاعه على الموافقة الالكترونية وسياسة الخصوصية من قبل الممرض أو المريض الآخر'
                            '\n\n\n9. إدارة حسابات المرضى من قبل الممرضين :\nمسؤولية الممرضين :'
                            '\n\n- الممرضون مسؤولون عن صحة ودقة البيانات التي يتم إدخالها'
                            '\n- يقر الممرضون بأنهم حصلوا على موافقة صريحة (البند 8) من المرضى قبل تسجيل بياناتهم'
                            '\n\nمسؤولية التطبيق :\n- نحن نعمل كوسيط تقني فقط لتسهيل التواصل'
                            '\n- لسنا مسؤولين عن دقة البيانات أو النزاعات المتعلقة بها'
                            '\n\nحقوق المرضى :\n- للمرضى الحق في مراجعة بياناتهم أو تعديلها أو طلب حذفها عبر الممرض المسؤول عن حسابهم ومن الدعم الفني لتأكيد العملية بشرط إثبات ملكيته للحساب بشكل مطلق'
                            '\n\n\n10. التعديلات على سياسة الخصوصية :\nنحتفظ بالحق في تعديل سياسة الخصوصية في أي وقت ، وسيتم إشعار المستخدمين بالتعديلات المهمة عبر التطبيق أو قنوات التواصل الاجتماعي لضمان اطلاعهم على أي تغييرات قد تؤثر على بياناتهم'
                            '\n\n\n11. العقد بين التطبيق والممرضين :'
                            '\n\nيُقر جميع الممرضين المستخدمين للتطبيق بأن مزاولة العمل عبره تتطلب توقيع عقد رسمي خطي لدى إدارة التطبيق.'
                            '\nهذا العقد إلزامي ويشترط توقيعه قبل تفعيل الحساب، ويتضمن الشروط المهنية والقانونية المتعلقة بالخدمة.'
                            '\nعدم توقيع العقد يؤدي إلى عدم تفعيل حساب الممرض نهائيًا دون أي مسؤولية على التطبيق'
                            //'\n2- التطبيق يعمل كوسيط بين المرضى والممرضين ولا يتحمل أي مسؤولية قانونية عن جودة الخدمات ويتحمل الممرض المسؤولية الكاملة عن أي خطأ طبي أو مخالفة قانونية تصدر عنه أثناء تقديم الخدمة.'
                            //'\n3- يلتزم الممرض بتقديم الخدمات وفقاً للمعايير الطبية المتعارف عليها ، ويتحمل المسؤولية القانونية والطبية الكاملة عن أي خطأ طبي أو إهمال'
                            //'\n4- يوافق الممرض على عدم تحميل التطبيق أي مسؤولية قانونية أو مالية عن أي مشكلة تنشأ أثناء تقديم الخدمات'
                            //'\n5- في حال تسبب الممرض في ضرر للمريض نتيجة إهمال أو خطأ طبي، يلتزم بتعويض المريض عن أي أضرار أو خسائر'
                            //'\n6- يلتزم الممرض بالحفاظ على سرية بيانات المرضى وعدم مشاركتها مع أي جهة غير مخوّلة بذلك'
                            //'\n7- يحق لإدارة التطبيق إيقاف حساب الممرض أو منعه من تقديم الخدمات عبر التطبيق في حال مخالفته لهذه الشروط أو سياسة الخصوصية'
                            //'\n8- يحتفظ التطبيق بحق تعديل هذا العقد وإشعار الممرضين بالتعديلات عند الضرورة'
                            '\n\n\n12- الاتصال بنا :'
                            '\nلأي استفسارات بخصوص سياسة الخصوصية أو العقد ، يمكنكم التواصل معنا عبر'
                            '\nالبريد الالكتروني : albsyrcompany@gmail.com',
                          style: TextStyle(fontSize: 16.0, color: Colors.black),
                          textDirection: TextDirection.rtl,
                        ),
                      ],
                    ),
                  ),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
