import 'dart:io';

import 'package:flutter/material.dart';
import 'package:homecare/widgets/header_widget.dart';

class PrivacyPolicyScreen extends StatelessWidget {
  const PrivacyPolicyScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Padding(
        padding: EdgeInsets.only(top: Platform.isIOS ? 50.0 : 25.0, bottom: 10.0),
        child: Stack(
          children: [
            Center(
              child: Image.asset('assets/images/ALB.png', color: Colors.grey.withValues(alpha: 0.2)),
            ),
            HeaderWidget(context, title: 'الملف الشخصي'),
            Padding(
              padding: const EdgeInsets.only(left: 10.0, right: 10.0, top: 50.0),
              child: SingleChildScrollView(
                physics: const BouncingScrollPhysics(),
                child: Center(
                  child: Column(
                    spacing: 25.0,
                    children: [
                      Text('سياسة الخصوصية لتطبيق ALB', style: TextStyle(fontSize: 20.0, fontWeight: FontWeight.bold)),
                      Text('نحن في ALB نولي أهمية كبيرة لحماية بيانات مستخدمينا وخصوصيتهم، ونلتزم بجميع بياناتهم ومعالجتها وفقاً لأفضل الممارسات القانونية والتقنية من خلال استخدام التطبيق، فإنك توافق على سياسة الخصوصية هذه وطريقة تعاملنا مع بياناتك الشخصية'
                          '\n\n1. البيانات التي نقوم بجمعها: عند استخدام التطبيق، نقوم بجمع البيانات التالية :'
                          '\n\n- المرضى\nالاسم الأول والثاني، رقم الهاتف ورقم الهاتف البديل ، العنوان، الجنس وتاريخ الميلاد، معلومات الزيارة الطبية'
                          '\n\n-الممرضون :\nالاسم الأول والثاني، رقم الهاتف ورقم الهاتف البديل، العنوان، الجنس وتاريخ الميلاد، صور الأوراق الرسمية التي تخوله لمزاولة المهنة'
                          '\n\n- الداعمون:\nالاسم الأول والثاني، رقم الهاتف، العنوان، نوع العمل، تاريخ الميلاد'
                          '\n\n- البيانات التقنية: \nسجل النشاط داخل التطبيق، مثل الأوقات والتواريخ'
                          '\n\n\n2. كيفية استخدام البيانات :\nنستخدم البيانات التي يتم جمعها للأغراض التالية :'
                          '\n\n- تقديم خدمات التطبيق وربط المرضى بالممرضين'
                          '\n- تحسين جودة الخدمات المقدمة'
                          '\nالتحقق من هوية المستخدمين وضمان أمان المعاملات داخل التطبيق'
                          '\n- مشاركة بعض البيانات مع الممرضين عند قبول الطلبات، بحيث يمكنهم الاطلاع فقط على معلومات آخر زيارة للمريض لضمان تقديم رعاية مناسبة'
                          '\n- مشاركة بعض البيانات مع شركات التأمين لتحسين جودة الخدمات، مع ضمان حماية خصوصية المستخدمين'
                          '\n\n\n3. مشاركة البيانات : قد نشارك بياناتك في الحالات التالية :'
                          '\n\n- مع الممرضين: عند قبول الطلب ، يسمح لهم فقط بمشاهدة معلومات آخر زيارة طبية للمريض'
                          '\n- مع شركات التأمين : قد نشارك بعض البيانات بالحد الأدنى اللازم لتحسين جودة الخدمات، مع الامتثال للقوانين المحلية والدولية'
                          '\n- عدم مشاركة بيانات الداعمين: بيانات الداعمين محفوظة بشكل كامل ولاتتم مشاركتها مع أي جهة'
                          '\n\n\n4. حقوق المستخدمين :\nيحق للمستخدمين :'
                          '\n\n- الوصول إلى بياناتهم الشخصية وتحديثها أو تصحيحها في أي وقت'
                          '\n- يحق للمستخدم طلب حذف بياناته الشخصية عبر قنوات الدعم الرئيسية، بشرط إثبات ملكيته للحساب بشكل مطلق. يحتفظ التطبيق بحق قبول أو رفض الطلب وفقاً لمتطلبات التحقق، والالتزامات القانونية، أو أي أسباب تشغيلية تراها الإدارة ضرورية ، مع إشعار المستخدم بقرارها خلال مدة زمنية معقولة.'
                          '\n\n\n5. التزامات المستخدمين : \nيتعين على المستخدمين الالتزام بالآتي :'
                          '\n\n- تقديم بيانات دقيقة ومحدثة لضمان تقديم الخدمات بشكل صحيح'
                          '\n- استخدام التطبيق فقط للأغراض المشروعة والمصرح بها'
                          '\n- عدم مشاركة بيانات تسجيل الدخول مع أي أطراف أخرى لحماية الحسابات من أي استخدام غير مصرح به'
                          '\n\n\n6. أمان البيانات:'
                          '\n- نحن نستخدم أحدث تقنيات الحماية لضمان أمان بيانات المستخدمين'
                          '\n- تخزين البيانات علي خوادم آمنة مع نسخ احتياطي دوري'
                          '\nورغم ذلك، لا يمكننا ضمان الحماية المطلقة من أي اختراق أمني أو فقدان للبيانات، ولا نتحمل أي مسؤولية عن أي ضرر ناتج عن ذلك'
                          '\n\n\n7. إخلاء المسؤولية القانونية :'
                          '\n- يعمل التطبيق كوسيط فقط ولا يتحمل أي مسؤولية قانونية عن جودة الخدمات المقدمة من قبل الممرضين'
                          '\n- الممرضون مستقلون تماماً عن التطبيق ولا يتعبروا موظفين لدينا'
                          '\n- لا يتحمل التطبيق أي مسؤولية قانونية زو مالية عن أي أضرار ناتجة عن إدخال بيانات غير صحيحة أو إساءة استخدامها من قبل الأطباء أو الممرضين'
                          '\n\n\n- 8. الموافقات الالكترونية :'
                          '\n- يمكن للمريض الموافقة على إدارة حسابه من قبل ممرض أو مريض آخر، مع إمكانية سحب الموافقة في أي وقت عبر التواصل مع الدعم الفني ، بشرط إثبات ملكية الحساب'
                          '\n- تتم الموافقة الالكترونية عبر إدخال كود تحقق يُرسل إلى المريض المُضاف بعد اطلاعه على الموافقة الالكترونية وسياسة الخصوصية من قبل الممرض أو المريض الآخر'
                          '\n\n\n9. إدارة حسابات المرضى من قبل الممرضين :\nمسؤولية الممرضين :'
                          '\n\n- الممرضون مسؤولون عن صحة ودقة البيانات التي يتم إدخالها'
                          '\n- يقر الممرضون بأنهم حصلوا على موافقة صريحة (البند 8) من المرضى قبل تسجيل بياناتهم'
                          '\n\nمسؤولية الشركة :\n- نحن نعمل كوسيط تقني فقط لتسهيل التواصل'
                          '\n- لسنا مسؤولين عن دقة البيانات أو النزاعات المتعلقة بها'
                          '\n\nحقوق المرضى :\n- للمرضى الحق في مراجعة بياناتهم أو تعديلها أو طلب حذفها عبر الممرض المسؤول عن حسابهم ومن الدعم الفني لتأكيد العملية بشرط إثبات ملكيته للحساب بشكل مطلق'
                          '\n\n\n10. التعديلات على سياسة الخصوصية :\nنحتفظ بالحق في تعديل سياسة الخصوصية في أي وقت ، وسيتم إشعار المستخدمين بالتعديلات المهمة عبر التطبيق أو قنوات التواصل الاجتماعي لضمان اطلاعهم على أي تغييرات قد تؤثر على بياناتهم'
                          '\n\n\n11. العقد بين التطبيق والممرضين :\nيلتزم الممرضون بالتوقيع على العقد التالي :'
                          '\n\n1- الممرض مستقل تماماً عن التطبيق ولا يعتبر موظفاً أو ممثلاً رسمياً له ولا يتحمل التطبيق أي مسؤولية قانونية أو مالية عن أفعال الممرض أثناء تقديم الخدمات'
                          '\n2- التطبيق يعمل كوسيط بين المرضى والممرضين ولا يتحمل أي مسؤولية قانونية عن جودة الخدمات ويتحمل الممرض المسؤولية الكاملة عن أي خطأ طبي أو مخالفة قانونية تصدر عنه أثناء تقديم الخدمة.'
                          '\n3- يلتزم الممرض بتقديم الخدمات وفقاً للمعايير الطبية المتعارف عليها ، ويتحمل المسؤولية القانونية والطبية الكاملة عن أي خطأ طبي أو إهمال'
                          '\n4- يوافق الممرض على عدم تحميل التطبيق أي مسؤولية قانونية أو مالية عن أي مشكلة تنشأ أثناء تقديم الخدمات'
                          '\n5- في حال تسبب الممرض في ضرر للمريض نتيجة إهمال أو خطأ طبي، يلتزم بتعويض المريض عن أي أضرار أو خسائر'
                          '\n6- يلتزم الممرض بالحفاظ على سرية بيانات المرضى وعدم مشاركتها مع أي جهة غير مخوّلة بذلك'
                          '\n7- يحق لإدارة التطبيق إيقاف حساب الممرض أو منعه من تقديم الخدمات عبر التطبيق في حال مخالفته لهذه الشروط أو سياسة الخصوصية'
                          '\n8- يحتفظ التطبيق بحق تعديل هذا العقد وإشعار الممرضين بالتعديلات عند الضرورة'
                          '\n\n\n12- الاتصال بنا :'
                          '\nلأي استفسارات بخصوص سياسة الخصوصية أو العقد ، يمكنكم التواصل معنا عبر'
                          '\nالبريد الالكتروني : nextechdevelop@gmail.com'
                          '\nالهاتف : رقم الهاتف',
                        style: TextStyle(fontSize: 16.0, color: Colors.black),
                        textDirection: TextDirection.rtl,
                      ),
                    ],
                  ),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
